content/dotfiles/emacs-j.org
#+TITLE: Emacs J Configuration
#+AUTHOR: Kyeong Soo Choi
#+STARTUP: overview
#+PROPERTY: header-args :emacs-lisp :mkdirp yes :results none

