content/dotfiles/emacs-j.org
* macOS
Path: =~/Library/Application Support/JetBrains/<IntelliJ_Version>/keymaps/EmacsJ_macOS.xml=
#+begin_src xml :tangle no
  <keymap version="1" name="EmacsJ_macOS" parent="EmacsJ">
    <action id="$Redo">
      <keyboard-shortcut first-keystroke="shift ctrl z" />
      <keyboard-shortcut first-keystroke="shift alt minus" />
      <keyboard-shortcut first-keystroke="shift ctrl slash" />
    </action>
    <action id="ActivateBookmarksToolWindow">
      <keyboard-shortcut first-keystroke="alt 2" />
      <keyboard-shortcut first-keystroke="meta 2" />
    </action>
    <action id="ActivateCommitToolWindow">
      <keyboard-shortcut first-keystroke="alt 0" />
      <keyboard-shortcut first-keystroke="meta 0" />
    </action>
    <action id="ActivateDebugToolWindow">
      <keyboard-shortcut first-keystroke="alt 5" />
      <keyboard-shortcut first-keystroke="meta 5" />
    </action>
    <action id="ActivateFindToolWindow">
      <keyboard-shortcut first-keystroke="alt 3" />
      <keyboard-shortcut first-keystroke="meta 3" />
    </action>
    <action id="ActivateProblemsViewToolWindow">
      <keyboard-shortcut first-keystroke="alt 6" />
      <keyboard-shortcut first-keystroke="meta 6" />
    </action>
    <action id="ActivateProjectToolWindow">
      <keyboard-shortcut first-keystroke="alt 1" />
      <keyboard-shortcut first-keystroke="meta 1" />
    </action>
    <action id="ActivateRunToolWindow">
      <keyboard-shortcut first-keystroke="alt 4" />
      <keyboard-shortcut first-keystroke="meta 4" />
    </action>
    <action id="ActivateServicesToolWindow">
      <keyboard-shortcut first-keystroke="alt 8" />
      <keyboard-shortcut first-keystroke="meta 8" />
    </action>
    <action id="ActivateStructureToolWindow">
      <keyboard-shortcut first-keystroke="alt 7" />
      <keyboard-shortcut first-keystroke="meta 7" />
    </action>
    <action id="ActivateTerminalToolWindow">
      <keyboard-shortcut first-keystroke="alt f12" />
      <keyboard-shortcut first-keystroke="meta f12" />
    </action>
    <action id="ActivateVersionControlToolWindow">
      <keyboard-shortcut first-keystroke="alt 9" />
      <keyboard-shortcut first-keystroke="meta 9" />
    </action>
    <action id="CommentByBlockComment">
      <keyboard-shortcut first-keystroke="shift ctrl divide" />
    </action>
    <action id="Console.TableResult.CloneRow" />
    <action id="ConvertJavaToKotlin" />
    <action id="DatabaseView.CopyAction" />
    <action id="Diff.FocusOppositePane" />
    <action id="Editor Redo">
      <keyboard-shortcut first-keystroke="shift ctrl slash" />
    </action>
    <action id="EditorDownWithSelection">
      <keyboard-shortcut first-keystroke="shift down" />
      <keyboard-shortcut first-keystroke="shift ctrl n" />
    </action>
    <action id="EditorDuplicate" />
    <action id="EditorLeftWithSelection">
      <keyboard-shortcut first-keystroke="shift left" />
      <keyboard-shortcut first-keystroke="shift ctrl b" />
    </action>
    <action id="EditorLineEndWithSelection">
      <keyboard-shortcut first-keystroke="shift end" />
      <keyboard-shortcut first-keystroke="shift ctrl e" />
    </action>
    <action id="EditorLineStart">
      <keyboard-shortcut first-keystroke="home" />
      <keyboard-shortcut first-keystroke="ctrl a" />
      <keyboard-shortcut first-keystroke="alt m" />
      <keyboard-shortcut first-keystroke="meta m" />
    </action>
    <action id="EditorLineStartWithSelection">
      <keyboard-shortcut first-keystroke="shift home" />
      <keyboard-shortcut first-keystroke="shift ctrl a" />
      <keyboard-shortcut first-keystroke="shift meta m" />
    </action>
    <action id="EditorNextWordInDifferentHumpsModeWithSelection">
      <keyboard-shortcut first-keystroke="shift meta f" />
    </action>
    <action id="EditorPageDownWithSelection">
      <keyboard-shortcut first-keystroke="shift page_down" />
      <keyboard-shortcut first-keystroke="shift ctrl v" />
    </action>
    <action id="EditorPageUp">
      <keyboard-shortcut first-keystroke="page_up" />
      <keyboard-shortcut first-keystroke="ctrl z" />
      <keyboard-shortcut first-keystroke="alt v" />
      <keyboard-shortcut first-keystroke="meta v" />
    </action>
    <action id="EditorPageUpWithSelection">
      <keyboard-shortcut first-keystroke="shift page_up" />
      <keyboard-shortcut first-keystroke="shift meta v" />
    </action>
    <action id="EditorPasteSimple">
      <keyboard-shortcut first-keystroke="shift ctrl alt v" />
      <keyboard-shortcut first-keystroke="shift ctrl meta v" />
    </action>
    <action id="EditorPreviousWordInDifferentHumpsModeWithSelection">
      <keyboard-shortcut first-keystroke="shift meta b" />
    </action>
    <action id="EditorRightWithSelection">
      <keyboard-shortcut first-keystroke="shift right" />
      <keyboard-shortcut first-keystroke="shift ctrl f" />
    </action>
    <action id="EditorSelectWord">
      <keyboard-shortcut first-keystroke="alt h" />
    </action>
    <action id="EditorUnSelectWord">
      <keyboard-shortcut first-keystroke="shift alt h" />
    </action>
    <action id="EditorUpWithSelection">
      <keyboard-shortcut first-keystroke="shift up" />
      <keyboard-shortcut first-keystroke="shift ctrl p" />
    </action>
    <action id="ExpressionTypeInfo" />
    <action id="FindInPath" />
    <action id="FindSelectionInPath" />
    <action id="Generate">
      <keyboard-shortcut first-keystroke="alt insert" />
      <keyboard-shortcut first-keystroke="meta help" />
    </action>
    <action id="Git.Commit.And.Push.Executor" />
    <action id="GotoAction">
      <keyboard-shortcut first-keystroke="escape" second-keystroke="x" />
      <keyboard-shortcut first-keystroke="alt x" />
      <keyboard-shortcut first-keystroke="meta x" />
    </action>
    <action id="GotoDeclaration">
      <keyboard-shortcut first-keystroke="ctrl alt g" />
      <keyboard-shortcut first-keystroke="escape" second-keystroke="period" />
      <keyboard-shortcut first-keystroke="alt period" />
      <mouse-shortcut keystroke="control button1" />
      <keyboard-shortcut first-keystroke="meta period" />
    </action>
    <action id="GotoTypeDeclaration">
      <mouse-shortcut keystroke="shift control button1" />
    </action>
    <action id="Inline">
      <keyboard-shortcut first-keystroke="ctrl alt n" />
      <keyboard-shortcut first-keystroke="ctrl meta n" />
    </action>
    <action id="JupyterNotebookCutCellCommandModeAction">
      <keyboard-shortcut first-keystroke="x" />
    </action>
    <action id="JupyterNotebookPasteCellAboveCommandModeAction">
      <keyboard-shortcut first-keystroke="shift v" />
    </action>
    <action id="MethodDown">
      <keyboard-shortcut first-keystroke="alt down" />
      <keyboard-shortcut first-keystroke="ctrl alt e" />
      <keyboard-shortcut first-keystroke="meta down" />
    </action>
    <action id="MethodUp">
      <keyboard-shortcut first-keystroke="alt up" />
      <keyboard-shortcut first-keystroke="ctrl alt a" />
      <keyboard-shortcut first-keystroke="meta up" />
    </action>
    <action id="MoveElementLeft">
      <keyboard-shortcut first-keystroke="shift ctrl alt left" />
      <keyboard-shortcut first-keystroke="shift ctrl meta left" />
    </action>
    <action id="MoveElementRight">
      <keyboard-shortcut first-keystroke="shift ctrl alt right" />
      <keyboard-shortcut first-keystroke="shift ctrl meta right" />
    </action>
    <action id="MoveLineDown">
      <keyboard-shortcut first-keystroke="shift alt down" />
      <keyboard-shortcut first-keystroke="shift meta down" />
    </action>
    <action id="MoveLineUp">
      <keyboard-shortcut first-keystroke="shift alt up" />
      <keyboard-shortcut first-keystroke="shift meta up" />
    </action>
    <action id="RecentFiles">
      <keyboard-shortcut first-keystroke="ctrl x" second-keystroke="ctrl b" />
      <keyboard-shortcut first-keystroke="ctrl x" second-keystroke="b" />
    </action>
    <action id="RecentLocations" />
    <action id="Refactorings.QuickListPopupAction">
      <keyboard-shortcut first-keystroke="shift ctrl alt t" />
      <keyboard-shortcut first-keystroke="shift ctrl meta t" />
    </action>
    <action id="ReloadScriptConfiguration" />
    <action id="RunDashboard.CopyConfiguration" />
    <action id="SelectIn">
      <keyboard-shortcut first-keystroke="alt f1" />
      <keyboard-shortcut first-keystroke="meta f1" />
    </action>
    <action id="SelectNextOccurrence">
      <keyboard-shortcut first-keystroke="alt j" />
      <keyboard-shortcut first-keystroke="meta j" />
    </action>
    <action id="SurroundWith">
      <keyboard-shortcut first-keystroke="ctrl alt t" />
      <keyboard-shortcut first-keystroke="ctrl meta t" />
    </action>
    <action id="Switcher">
      <keyboard-shortcut first-keystroke="ctrl tab" />
    </action>
    <action id="SwitcherBackward">
      <keyboard-shortcut first-keystroke="shift ctrl tab" />
    </action>
    <action id="SwitcherFallback" />
    <action id="SwitcherForward">
      <keyboard-shortcut first-keystroke="ctrl tab" />
    </action>
    <action id="Vcs.Push" />
    <action id="XDebugger.CopyWatch" />
    <action id="com.github.strindberg.emacsj.actions.duplicate.commentdwim">
      <keyboard-shortcut first-keystroke="alt semicolon" />
      <keyboard-shortcut first-keystroke="meta semicolon" />
      <keyboard-shortcut first-keystroke="ctrl x" second-keystroke="ctrl semicolon" />
    </action>
    <action id="com.github.strindberg.emacsj.actions.kill.append">
      <keyboard-shortcut first-keystroke="ctrl alt w" />
      <keyboard-shortcut first-keystroke="ctrl meta w" />
    </action>
    <action id="com.github.strindberg.emacsj.actions.kill.copy">
      <keyboard-shortcut first-keystroke="alt w" />
      <keyboard-shortcut first-keystroke="meta w" />
    </action>
    <action id="com.github.strindberg.emacsj.actions.kill.wholeline">
      <keyboard-shortcut first-keystroke="ctrl alt k" />
      <keyboard-shortcut first-keystroke="shift meta k" />
    </action>
    <action id="com.github.strindberg.emacsj.actions.movement.textend">
      <keyboard-shortcut first-keystroke="alt greater" />
      <keyboard-shortcut first-keystroke="shift alt less" />
      <keyboard-shortcut first-keystroke="shift meta period" />
    </action>
    <action id="com.github.strindberg.emacsj.actions.movement.textstart">
      <keyboard-shortcut first-keystroke="alt less" />
      <keyboard-shortcut first-keystroke="shift meta comma" />
    </action>
    <action id="com.github.strindberg.emacsj.actions.paste.pastehistory">
      <keyboard-shortcut first-keystroke="alt y" />
      <keyboard-shortcut first-keystroke="meta y" />
    </action>
    <action id="com.github.strindberg.emacsj.actions.search.isearchchar">
      <keyboard-shortcut first-keystroke="ctrl alt y" />
      <keyboard-shortcut first-keystroke="ctrl meta y" />
    </action>
    <action id="com.github.strindberg.emacsj.actions.search.isearchedit">
      <keyboard-shortcut first-keystroke="alt e" />
      <keyboard-shortcut first-keystroke="meta e" />
    </action>
    <action id="com.github.strindberg.emacsj.actions.search.isearchline">
      <keyboard-shortcut first-keystroke="ctrl alt e" />
      <keyboard-shortcut first-keystroke="ctrl meta e" />
    </action>
    <action id="com.github.strindberg.emacsj.actions.search.isearchmark">
      <keyboard-shortcut first-keystroke="alt enter" />
      <keyboard-shortcut first-keystroke="meta enter" />
    </action>
    <action id="com.github.strindberg.emacsj.actions.search.isearchnext">
      <keyboard-shortcut first-keystroke="alt n" />
      <keyboard-shortcut first-keystroke="meta n" />
    </action>
    <action id="com.github.strindberg.emacsj.actions.search.isearchprevious">
      <keyboard-shortcut first-keystroke="alt p" />
      <keyboard-shortcut first-keystroke="meta p" />
    </action>
    <action id="com.github.strindberg.emacsj.actions.search.replacenext">
      <keyboard-shortcut first-keystroke="alt n" />
      <keyboard-shortcut first-keystroke="meta n" />
    </action>
    <action id="com.github.strindberg.emacsj.actions.search.replaceprevious">
      <keyboard-shortcut first-keystroke="alt p" />
      <keyboard-shortcut first-keystroke="meta p" />
    </action>
    <action id="com.github.strindberg.emacsj.actions.search.replaceregexp">
      <keyboard-shortcut first-keystroke="shift alt s" />
      <keyboard-shortcut first-keystroke="shift meta s" />
    </action>
    <action id="com.github.strindberg.emacsj.actions.search.replacetext">
      <keyboard-shortcut first-keystroke="alt s" />
      <keyboard-shortcut first-keystroke="meta s" />
    </action>
    <action id="com.github.strindberg.emacsj.actions.space.onespace">
      <keyboard-shortcut first-keystroke="alt space" />
      <keyboard-shortcut first-keystroke="meta space" />
    </action>
    <action id="com.github.strindberg.emacsj.actions.universal.universalargument0">
      <keyboard-shortcut first-keystroke="ctrl alt 0" />
      <keyboard-shortcut first-keystroke="ctrl meta 0" />
    </action>
    <action id="com.github.strindberg.emacsj.actions.universal.universalargument1">
      <keyboard-shortcut first-keystroke="ctrl alt 1" />
      <keyboard-shortcut first-keystroke="ctrl meta 1" />
    </action>
    <action id="com.github.strindberg.emacsj.actions.universal.universalargument2">
      <keyboard-shortcut first-keystroke="ctrl alt 2" />
      <keyboard-shortcut first-keystroke="ctrl meta 2" />
    </action>
    <action id="com.github.strindberg.emacsj.actions.universal.universalargument3">
      <keyboard-shortcut first-keystroke="ctrl alt 3" />
      <keyboard-shortcut first-keystroke="ctrl meta 3" />
    </action>
    <action id="com.github.strindberg.emacsj.actions.universal.universalargument4">
      <keyboard-shortcut first-keystroke="ctrl alt 4" />
      <keyboard-shortcut first-keystroke="ctrl meta 4" />
    </action>
    <action id="com.github.strindberg.emacsj.actions.universal.universalargument5">
      <keyboard-shortcut first-keystroke="ctrl alt 5" />
      <keyboard-shortcut first-keystroke="ctrl meta 5" />
    </action>
    <action id="com.github.strindberg.emacsj.actions.universal.universalargument6">
      <keyboard-shortcut first-keystroke="ctrl alt 6" />
      <keyboard-shortcut first-keystroke="ctrl meta 6" />
    </action>
    <action id="com.github.strindberg.emacsj.actions.universal.universalargument7">
      <keyboard-shortcut first-keystroke="ctrl alt 7" />
      <keyboard-shortcut first-keystroke="ctrl meta 7" />
    </action>
    <action id="com.github.strindberg.emacsj.actions.universal.universalargument8">
      <keyboard-shortcut first-keystroke="ctrl alt 8" />
      <keyboard-shortcut first-keystroke="ctrl meta 8" />
    </action>
    <action id="com.github.strindberg.emacsj.actions.universal.universalargument9">
      <keyboard-shortcut first-keystroke="ctrl alt 9" />
      <keyboard-shortcut first-keystroke="ctrl meta 9" />
    </action>
    <action id="com.github.strindberg.emacsj.actions.word.capitalcase">
      <keyboard-shortcut first-keystroke="alt c" />
      <keyboard-shortcut first-keystroke="meta c" />
    </action>
    <action id="com.github.strindberg.emacsj.actions.word.capitalcaseprevious">
      <keyboard-shortcut first-keystroke="shift alt c" />
      <keyboard-shortcut first-keystroke="shift meta c" />
    </action>
    <action id="com.github.strindberg.emacsj.actions.word.deletenextword">
      <keyboard-shortcut first-keystroke="alt d" />
      <keyboard-shortcut first-keystroke="meta d" />
    </action>
    <action id="com.github.strindberg.emacsj.actions.word.deletepreviousword">
      <keyboard-shortcut first-keystroke="alt back_space" />
      <keyboard-shortcut first-keystroke="meta back_space" />
    </action>
    <action id="com.github.strindberg.emacsj.actions.word.lowercase">
      <keyboard-shortcut first-keystroke="alt l" />
      <keyboard-shortcut first-keystroke="meta l" />
    </action>
    <action id="com.github.strindberg.emacsj.actions.word.lowercaseprevious">
      <keyboard-shortcut first-keystroke="shift alt l" />
      <keyboard-shortcut first-keystroke="shift meta l" />
    </action>
    <action id="com.github.strindberg.emacsj.actions.word.movenextword">
      <keyboard-shortcut first-keystroke="alt f" />
      <keyboard-shortcut first-keystroke="meta f" />
    </action>
    <action id="com.github.strindberg.emacsj.actions.word.movepreviousword">
      <keyboard-shortcut first-keystroke="alt b" />
      <keyboard-shortcut first-keystroke="meta b" />
    </action>
    <action id="com.github.strindberg.emacsj.actions.word.transposewords">
      <keyboard-shortcut first-keystroke="alt t" />
      <keyboard-shortcut first-keystroke="meta t" />
    </action>
    <action id="com.github.strindberg.emacsj.actions.word.transposewordsreverse">
      <keyboard-shortcut first-keystroke="shift alt t" />
      <keyboard-shortcut first-keystroke="shift meta t" />
    </action>
    <action id="com.github.strindberg.emacsj.actions.word.uppercase">
      <keyboard-shortcut first-keystroke="alt u" />
      <keyboard-shortcut first-keystroke="meta u" />
    </action>
    <action id="com.github.strindberg.emacsj.actions.word.uppercaseprevious">
      <keyboard-shortcut first-keystroke="shift alt u" />
      <keyboard-shortcut first-keystroke="shift meta u" />
    </action>
    <action id="com.github.strindberg.emacsj.actions.xref.xrefforward">
      <keyboard-shortcut first-keystroke="ctrl alt comma" />
      <keyboard-shortcut first-keystroke="ctrl meta comma" />
    </action>
  </keymap>
#+end_src